# 第1行
from fastapi import FastAPI
# 意思：从fastapi这个工具包里面，导入FastAPI这个工具。
# fastapi是别人写好的web框架，专门用来做接口，不用我们从零写网络底层代码。

# 第2行
import uvicorn
# 意思：导入uvicorn，它是一个服务器，负责跑起我们写的接口程序，接收浏览器发来的请求。

# 第4行
app = FastAPI()
# 创建一个接口应用实例，app就代表我们这个web服务本身。后面所有接口都挂载在app上面。

# 第5行
@app.get("/")
# 这叫「装饰器」：定义一个GET请求接口。
# "/" 代表网站根路径，也就是访问地址：http://127.0.0.1:8000/
# get：浏览器直接在地址栏输入网址访问，就是GET请求。

# 第6、7行
def read_root():
    return {"Hello": "World"}
# 定义一个函数 read_root
# 当有人访问上面这个`/`地址的时候，自动执行这个函数。
# return 返回一个字典，网页上就会展示JSON：{"Hello": "World"}

# 第9行
if __name__ == "__main__":
# 固定写法：只有我们直接运行这个main.py文件的时候，才执行下面这一行。
# 如果这个文件被别的代码导入使用，下面代码不会执行。

# 第10行
    uvicorn.run(app, host="0.0.0.0", port=7879)
# 启动uvicorn服务器，运行我们写好的app服务
# host="0.0.0.0"：允许本机其他电脑/设备访问这个服务；如果写127.0.0.1就只能自己电脑访问
# port=8000：程序占用8000端口，访问地址就是 127.0.0.1:8000
